---
kind: method
id: M:Autodesk.Revit.DB.View.IsTemporaryHideIsolateActive
zh: 视图
source: html/8a9bb21f-7d4b-0914-5a40-b146670fe99d.htm
---
# Autodesk.Revit.DB.View.IsTemporaryHideIsolateActive Method

**中文**: 视图

Indicates if the view is temporarily hiding or isolating elements or categories.

## Syntax (C#)
```csharp
public bool IsTemporaryHideIsolateActive()
```

## Returns
True if elements/categories are being temporarily hidden or isolated, false otherwise.